mrdunk/esp8266_mqtt_kitchensink/src/http_server.cpp
        int tmp_buffer_in_len = list_template[list_depth].buffer_len;
        char* tmp_buffer_in = (char*)malloc(tmp_buffer_in_len);
        memcpy(tmp_buffer_in, list_template[list_depth].buffer, tmp_buffer_in_len);
        bool parsing_list_inner = false;
        parseBuffer(tmp_buffer_in, tmp_buffer_in_len,
                    buffer_out, buffer_out_len, list_depth, parsing_list_inner);
        free(tmp_buffer_in);
      }

      buffer_tail = close_tag + strlen(list_template[list_depth].tag) + strlen("{{/}}");
      
      free(list_template[list_depth].buffer);
      list_template[list_depth].buffer = NULL;
      list_template[list_depth].buffer_len = 0;
      exitList(list_parent);
      list_depth--;
      parsing_list = false;
        
    } else if(tag_start && tagName(tag_start, tag, type)){
      // {{tag}} found.

      int len_to_tag = tag_start - buffer_tail;
      int len_buff_space = buffer_out_len - strlen(buffer_out) -1;
      if(len_to_tag > len_buff_space){
        // Only enough space in output buffer for content before {{tag}}.
        buffer_out_len += len_to_tag + TAG_NAME_LEN;
        buffer_out = (char*)realloc((void*)buffer_out, buffer_out_len);
        if(!buffer_out){
          Serial.println("ERROR: Failed realloc()");
          break;
        }
      }

      strncat(buffer_out, buffer_tail, len_to_tag);
      len_buff_space -= len_to_tag;

      char tag_content[128];
      int itterator = 0;
      int element_count = 0;

      if(type == tagPlain){
        replaceTag(tag_content, itterator, element_count, tag, type, 128, list_depth);
        if(strlen(tag_content) > len_buff_space){
          len_buff_space = strlen(tag_content);
          buffer_out_len += strlen(tag_content);
          buffer_out = (char*)realloc((void*)buffer_out, buffer_out_len);
          if(!buffer_out){
            Serial.println("ERROR: Failed realloc()");
            break;
          }
        }
        strncat(buffer_out, tag_content, len_buff_space);
        buffer_tail += len_to_tag + strnlen(tag, 128) + strlen("{{}}");
      } else if(type == tagList || type == tagInverted){

        parsing_list = true;
        list_depth++;
        enterList(list_parent, tag);

        strncpy(list_template[list_depth].tag, tag, TAG_NAME_LEN);
        list_template[list_depth].inverted = (type == tagInverted);
        list_template[list_depth].buffer = (char*)malloc(1);
        list_template[list_depth].buffer_len = 1;
        list_template[list_depth].buffer[0] = '\0';
        buffer_tail = tag_start + strlen(tag) + strlen("{{#}}");
      }
    } else if(tag_start &&
        tag_start >= (buffer_in + buffer_in_len - TAG_NAME_LEN - strlen("{{#}}")))
    {
      // File content with no {{tag}} followed by a {{tag}} near the end.
      // Since the {{tag}} is possibly not completely in the buffer_in, only
      // process everything up to {{tag}}.
      if(tag_start - buffer_tail <= 0){
        // All data worth sending has been added to buffer_out.
        break;
      }
      if(tag_start - buffer_tail > buffer_out_len - strlen(buffer_out) -1){
        buffer_out_len += tag_start - buffer_tail;
        buffer_out = (char*)realloc((void*)buffer_out, buffer_out_len);
      }
      strncat(buffer_out, buffer_tail, tag_start - buffer_tail);
      buffer_tail += tag_start - buffer_tail;
    } else {
      // No {{tag}} in buffer_in. Copy everything to buffer_out.
      if(strlen(buffer_tail) > buffer_out_len - strlen(buffer_out) -1){
        buffer_out_len += strlen(buffer_tail);
        buffer_out = (char*)realloc((void*)buffer_out, buffer_out_len);
      }
      strncat(buffer_out, buffer_tail, strlen(buffer_tail));
      buffer_tail += strlen(buffer_tail);
    }
  }

  memmove(buffer_in, buffer_tail, strlen(buffer_tail) +1);

}

char* CompileMustache::findClosingTag(char* buffer_in, const int buffer_in_len,
                                      const char* tag)
{
  char full_tag[TAG_NAME_LEN + strlen("{{/}}") +1];
  full_tag[0] = '\0';
  strcat(full_tag, "{{/");
  strcat(full_tag, tag);
  strcat(full_tag, "}}");
  return findPattern(buffer_in, full_tag, buffer_in_len);
}


bool CompileMustache::tagName(char* tag_start, char* tag, tagType& type){
  type = tagUnset;
  if(!tag_start || tag_start[0] != '{' || tag_start[1] != '{'){
    return false;
  }
  tag_start += 2;

  for(int i = 0; i < TAG_NAME_LEN; i++){
    // Skip through any "{{" deliminators and whitespace to start of tag name.
    if(*tag_start >= '!' and *tag_start <= 'z' and
        *tag_start != '#' and *tag_start != '^'){
      break;
    }
    switch(*tag_start)
    {
      case '#':
        if(type != tagUnset) {return false;}
        type = tagList;
        break;
      case '^':
        if(type != tagUnset) {return false;}
        type = tagInverted;
        break;
    }

    tag_start ++;
  }
  if(type == tagUnset){
    type = tagPlain;
  }

  if(findPattern(tag_start, "}}", TAG_NAME_LEN)){
    strncpy(tag, tag_start, TAG_NAME_LEN);
    char* end_pattern = findPattern(tag, "}}", TAG_NAME_LEN);
    if(end_pattern){
      *end_pattern = '\0';
      while(strlen(tag)){
        if(tag[strlen(tag)] == ' '){
          // Remove trailing whitespace.
          tag[strlen(tag)] = '\0';
        } else {
          break;
        }
      }
      return true;
    }
    // empty string.
    tag[0] = '\0';
  }
  return false;
}

void CompileMustache::replaceTag(char* destination,
                                  int& itterator,
                                  int& element_count,
                                  const char* tag,
                                  const tagType type,
                                  const int len,
                                  const int list_depth)
{
  /*Serial.print("t  |");
  Serial.print(tag);
  Serial.print("  ");
  Serial.println(type);*/

  memset(destination, '\0', len);
  element_count = 0;

  if(strcmp(tag, "host.mac") == 0){
    uint8_t mac[6];
    WiFi.macAddress(mac);
    String mac_str = macToStr(mac);
    mac_str.toCharArray(destination, len);
    element_count = 1;
  } else if(strcmp(tag, "config.hostname") == 0){
    strncpy(destination, config->hostname, min(HOSTNAME_LEN, len));
    element_count = (bool)strlen(destination);
  } else if(strcmp(tag, "host.ip") == 0){
    ip_to_string(WiFi.localIP()).toCharArray(destination, len);
    element_count = (bool)WiFi.localIP();
  } else if(strcmp(tag, "config.ip") == 0){
    ip_to_string(config->ip).toCharArray(destination, len);
    element_count = (bool)config->ip;
  } else if(strcmp(tag, "config.subnet") == 0){
    ip_to_string(config->subnet).toCharArray(destination, len);
    element_count = (bool)config->subnet;
  } else if(strcmp(tag, "config.gateway") == 0){
    ip_to_string(config->gateway).toCharArray(destination, len);
    element_count = (bool)config->gateway;
  } else if(strcmp(tag, "config.brokerip") == 0){
    ip_to_string(config->brokerip).toCharArray(destination, len);
    element_count = (bool)config->brokerip;
  } else if(strcmp(tag, "config.brokerport") == 0){
    String(config->brokerport).toCharArray(destination, len);
    element_count = config->brokerport > 0;
  } else if(strcmp(tag, "config.subscribeprefix") == 0){
    String(config->subscribeprefix).toCharArray(destination, len);
    element_count = (bool)strnlen(destination, len);
  } else if(strcmp(tag, "config.publishprefix") == 0){
    String(config->publishprefix).toCharArray(destination, len);
    element_count = (bool)strnlen(destination, len);
  } else if(strcmp(tag, "config.firmwarehost") == 0){
    String(config->firmwarehost).toCharArray(destination, len);
    element_count = (bool)strnlen(destination, len);
  } else if(strcmp(tag, "config.firmwaredirectory") == 0){
    String(config->firmwaredirectory).toCharArray(destination, len);
    element_count = (bool)strnlen(destination, len);
  } else if(strcmp(tag, "config.firmwareport") == 0){
    String(config->firmwareport).toCharArray(destination, len);
    element_count = config->firmwareport > 0;
  } else if(strcmp(tag, "config.enablepassphrase") == 0){
    String(config->enablepassphrase).toCharArray(destination, len);
    element_count = (bool)strnlen(destination, len);
  } else if(strcmp(tag, "host.rssi") == 0){
    String(WiFi.RSSI()).toCharArray(destination, len);
    element_count = (bool)strnlen(destination, len);
  } else if(strcmp(tag, "host.cpu_freqency") == 0){
    String(ESP.getCpuFreqMHz()).toCharArray(destination, len);
    element_count = (bool)strnlen(destination, len);
  } else if(strcmp(tag, "host.flash_size") == 0){
    String(ESP.getFlashChipSize()).toCharArray(destination, len);
    element_count = ESP.getFlashChipSize() > 0;
  } else if(strcmp(tag, "host.flash_space") == 0){
    String(ESP.getFreeSketchSpace()).toCharArray(destination, len);
    element_count = ESP.getFreeSketchSpace() > 0;
  } else if(strcmp(tag, "host.flash_ratio") == 0){
    element_count = 0;
    if(ESP.getFlashChipSize() > 0){
      String(int(100 * ESP.getFreeSketchSpace() / ESP.getFlashChipSize()))
        .toCharArray(destination, len);
      element_count = (100 * ESP.getFreeSketchSpace() / ESP.getFlashChipSize()) >= 1;
    }
  } else if(strcmp(tag, "host.flash_speed") == 0){
    String(ESP.getFlashChipSpeed()).toCharArray(destination, len);
    element_count = (bool)strnlen(destination, len);
  } else if(strcmp(tag, "host.free_memory") == 0){
    String(ESP.getFreeHeap()).toCharArray(destination, len);
    element_count = ESP.getFreeHeap() >= 1;
  } else if(strcmp(tag, "host.sdk_version") == 0){
    strncpy(destination, ESP.getSdkVersion(), len);
    element_count = (bool)strnlen(destination, len);
  } else if(strcmp(tag, "host.core_version") == 0){
    ESP.getCoreVersion().toCharArray(destination, len);
    element_count = (bool)strnlen(destination, len);
  } else if(strcmp(tag, "io.analogue_in") == 0){
    int val = analogRead(A0);
    String(val).toCharArray(destination, len);
    element_count = val > 0;
  } else if(strcmp(tag, "host.uptime") == 0){
    String(millis() / 1000).toCharArray(destination, len);
    element_count = (millis() / 1000) >= 10;
  } else if(strcmp(tag, "host.buffer_size") == 0){
    String(buffer_size).toCharArray(destination, len);
    element_count = buffer_size > 0;
  } else if(strcmp(tag, "mdns.packet_count") == 0){
    String(mdns->packet_count).toCharArray(destination, len);
    element_count = mdns->packet_count > 0;
  } else if(strcmp(tag, "mdns.buffer_fail") == 0){
    String(mdns->buffer_size_fail).toCharArray(destination, len);
    element_count = mdns->buffer_size_fail >= 0;
  } else if(strcmp(tag, "mdns.buffer_sucess") == 0){
    String(mdns->packet_count - mdns->buffer_size_fail).toCharArray(destination, len);
    element_count = (mdns->packet_count - mdns->buffer_size_fail) > 0;
  } else if(strcmp(tag, "mdns.largest_packet_seen") == 0){
    String(mdns->largest_packet_seen).toCharArray(destination, len);
    element_count = mdns->largest_packet_seen > 0;
  } else if(strcmp(tag, "mdns.success_rate") == 0){
    element_count = 0;
    if(mdns->packet_count > 0){
      String(100 - (100 * mdns->buffer_size_fail / mdns->packet_count))
        .toCharArray(destination, len);
      element_count = (100 * mdns->buffer_size_fail / mdns->packet_count) >= 1;
    }
  } else if(strcmp(tag, "fs.files") == 0){
    unsigned int now = millis() / 10000;  // 10 Second intervals.
    if(list_size[list_depth] < 0 || now != list_cache_time[list_depth]){
      list_cache_time[list_depth] = now;
      list_size[list_depth] = 0;
    
      Dir dir = SPIFFS.openDir("/");
      while(dir.next()){
        list_size[list_depth]++;
      }
    }
    if(type == tagListItem){
      list_element[list_depth]++;
    } else {
      list_element[list_depth] = -1;
      String(list_size[list_depth]).toCharArray(destination, len);
      element_count = list_size[list_depth];
    }
  } else if(strcmp(tag, "fs.space.used") == 0){
    FSInfo fs_info;
    SPIFFS.info(fs_info);
    String(fs_info.usedBytes).toCharArray(destination, len);
    element_count = fs_info.usedBytes > 0;
  } else if(strcmp(tag, "fs.space.size") == 0){
    FSInfo fs_info;
    SPIFFS.info(fs_info);
    String(fs_info.totalBytes).toCharArray(destination, len);
    element_count = fs_info.totalBytes > 0;
  } else if(strcmp(tag, "fs.space.remaining") == 0){
    FSInfo fs_info;
    SPIFFS.info(fs_info);
    String(fs_info.totalBytes - fs_info.usedBytes).toCharArray(destination, len);
    element_count = (fs_info.totalBytes - fs_info.usedBytes) > 0;
  } else if(strcmp(tag, "fs.space.ratio.used") == 0){
    FSInfo fs_info;
    SPIFFS.info(fs_info);
    if(fs_info.totalBytes > 0){
      String(100.0 * fs_info.usedBytes / fs_info.totalBytes).toCharArray(destination, len);
      element_count = (100.0 * fs_info.usedBytes / fs_info.totalBytes) >= 1;
    }
  } else if(strcmp(tag, "fs.space.ratio.remaining") == 0){
    FSInfo fs_info;
    SPIFFS.info(fs_info);
    if(fs_info.totalBytes > 0){
      String(100.0 * (fs_info.totalBytes - fs_info.usedBytes) / fs_info.totalBytes)
        .toCharArray(destination, len);
      element_count =
        (100.0 * (fs_info.totalBytes - fs_info.usedBytes) / fs_info.totalBytes) >= 1;
    }
  } else if(strcmp(tag, "fs.max_filename_len") == 0){
    FSInfo fs_info;
    SPIFFS.info(fs_info);
    String(fs_info.maxPathLength -2).toCharArray(destination, len);
  } else if(strcmp(tag, "servers.mqtt") == 0){
    Host* p_host;
    bool active;
    if(type == tagListItem){
      brokers->IterateHosts(&p_host, &active);
      list_element[list_depth]++;
    } else {
      list_size[list_depth] = 0;
      brokers->ResetIterater();
      while(brokers->IterateHosts(&p_host, &active)){
        list_size[list_depth]++;
      }
      brokers->ResetIterater();
      list_element[list_depth] = -1;
      String(list_size[list_depth]).toCharArray(destination, len);
      element_count = list_size[list_depth];
    }
  } else if(strcmp(tag, "host.ssids") == 0){
    unsigned int now = millis() / 10000;  // 10 Second intervals.
    if(list_size[list_depth] < 0 || now != list_cache_time[list_depth]){
      list_cache_time[list_depth] = now;
      list_size[list_depth] = WiFi.scanNetworks();
    }

    if(type == tagListItem){
      list_element[list_depth]++;
    } else {
      list_element[list_depth] = -1;
      String(list_size[list_depth]).toCharArray(destination, len);
      element_count = list_size[list_depth];
    }
  } else if(strcmp(tag, "io.entry") == 0){
    list_size[list_depth] = 0;
    for (int i = 0; i < MAX_DEVICES; ++i) {
      if (strlen(config->devices[i].address_segment[0].segment) > 0) {
        list_size[list_depth]++;
      }
    }
    if(list_size[list_depth] < MAX_DEVICES){
      list_size[list_depth]++;
    }

    if(type == tagListItem){
      list_element[list_depth]++;
      element_count = list_size[list_depth];
    } else {
      list_element[list_depth] = -1;
      String(list_size[list_depth]).toCharArray(destination, len);
      element_count = list_size[list_depth];
    }
  } else if(strcmp(tag, "iopin") == 0){
    list_size[list_depth] = 11;  // 11 IO pins available on the esp8266.
    if(type == tagListItem){
      list_element[list_depth]++;
      element_count = list_size[list_depth];
    } else {
      list_element[list_depth] = -1;
      String(list_size[list_depth]).toCharArray(destination, len);
      element_count = list_size[list_depth];
    }
  } else if(strcmp(tag, "iotype") == 0){
    list_size[list_depth] = 6;
    if(type == tagListItem){
      list_element[list_depth]++;
      element_count = list_size[list_depth];
    } else {
      list_element[list_depth] = -1;
      String(list_size[list_depth]).toCharArray(destination, len);
      element_count = list_size[list_depth];
    }
  }

